import React from 'react';

const nav = [
	[],
	[{0: 'Клиент'}, {10: 'Отправитель'}, {11: 'Получатель'}, {20: 'Курьер'}, {12: 'Детали отправления'}, {1: 'Финансы'}], // Доставка
	[{0: 'Клиент'}, {10: 'Отправитель'}, {11: 'Получатель'}, {12: 'Детали отправления'}, {30: 'Детали хранения'}, {1: 'Финансы'}], // Хранение
	[{0: 'Клиент'}, {10: 'Отправитель'}, {11: 'Получатель'}, {12: 'Детали отправления'}, {20: 'Курьер'}, {1: 'Финансы'}], // Почтовое обслуживание
	[{0: 'Клиент'}, {10: 'Отправитель'}, {11: 'Получатель'}, {20: 'Курьер'}, {12: 'Детали отправления'}, {1: 'Финансы'}], // Пересылка ч/з ПОЧТА РФ
	[{0: 'Клиент'}, {10: 'Отправитель'}, {11: 'Получатель'}, {12: 'Детали отправления'}, {40: 'Детали обработки'}, {1: 'Финансы'}], // Обработка документов
	[{0: 'Клиент'}, {10: 'Отправитель'}, {11: 'Получатель'}, {12: 'Детали отправления'}, {20: 'Курьер'}, {1: 'Финансы'}], // Аренда курьера
	[{0: 'Клиент'}, {10: 'Отправитель'}, {11: 'Получатель'}, {12: 'Детали отправления'}, {1: 'Финансы'}] // Расходы
]

export const FieldGroupNavigation = ({currentServ, navSelected, navClickHandler}) => {

	const renderNav = () =>
		nav[currentServ] ? nav[currentServ].map( el => {
			for(let key in el) {
				const fullClassName = 'nav-menu__item' + (navSelected === +key ? ' active' : '');
				const clickHandler = () => navClickHandler(+key);
				
				return(
					<span
						key={ +key }
						className={ fullClassName }
						onClick={ clickHandler }>
						{ el[key] }
					</span>
				)
			}
		} ) : null;

	return(
		<nav className='nav-menu'>
			{ renderNav() }
		</nav>
	)
};